Change diagram to mermaid
